# Задача №24

#  В фермерском хозяйстве в Карелии выращивают чернику. Она растет на
# круглой грядке, причем кусты высажены только по окружности. Таким образом, у
# каждого куста есть ровно два соседних. Всего на грядке растет N кустов.
# Эти кусты обладают разной урожайностью, поэтому ко времени сбора на них
# выросло различное число ягод – на i-ом кусте выросло ai ягод.
# В этом фермерском хозяйстве внедрена система автоматического сбора черники.
# Эта система состоит из управляющего модуля и нескольких собирающих модулей.
# Собирающий модуль за один заход, находясь непосредственно перед некоторым
# кустом, собирает ягоды с этого куста и с двух соседних с ним.
# Напишите программу для нахождения максимального числа ягод, которое может
# собрать за один заход собирающий модуль, находясь перед некоторым кустом
# заданной во входном файле грядки.


# Решение :


n = int(input("Введите количество кустов: "))
berries = []

for i in range(n):
    berries.append(int(input(f"Введите количество ягод на {i+1}-ом кусте: ")))

max_berries = 0
for i in range(n):
    curr_berries = berries[i] + berries[i-1] + berries[i-2]
    max_berries = max(max_berries, curr_berries)

print(f"Максимальное количество ягод, которое может собрать собирающий модуль: {max_berries}")